app/controllers/beers_controller.rb

  def index #GET
    @beers = Beer.all
---
SELECT "beers".* FROM "beers"

  def show_name
    # brewery_db = BreweryDB::Client.new do |config|
    #   config.api_key = ENV['BREWERYDB']
    # end
    fuzzy = FuzzyMatch.new(Beer.all, :read => :name)
---
SELECT "beers".* FROM "beers"

  def create #POST
    @beer = Beer.new(beer_params)
    if @beer.save
---
INSERT INTO "beers" ("name", "brewery", "style", "abv", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Corona"], ["brewery", "Corona"], ["style", "Light Lager"], ["abv", "4.5"], ["created_at", "2015-05-30 21:10:36.160594"], ["updated_at", "2015-05-30 21:10:36.160594"]]

  def show #GET
    @beer = Beer.find(params[:id])
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT 1  [["id", 7]]

  def update #PATCH
    @beer = Beer.find(params[:id])
    if @beer.update(beer_params)
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "beers" SET "name" = $1, "brewery" = $2, "style" = $3, "abv" = $4, "updated_at" = $5 WHERE "beers"."id" = $6  [["name", "Fat Tire"], ["brewery", "New Belgium Brewery"], ["style", "Amber Ale"], ["abv", "5.2"], ["updated_at", "2015-05-30 21:16:09.599112"], ["id", 7]]

  def destroy #DELETE
    @beer = Beer.find(params[:id])
    @beer.delete
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "beers" WHERE "beers"."id" = $1  [["id", 8]]