app/controllers/lists_controller.rb

INSERT INTO "lists" ("beer_id", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["beer_id", 3], ["location_id", 3], ["created_at", "2015-06-04 14:33:32.679765"], ["updated_at", "2015-06-04 14:33:32.679765"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."location_id" = $1  [["location_id", 1]]
---
  def show_location
     @list = List.where location_id: params[:id]

SELECT "lists".* FROM "lists" WHERE "lists"."beer_id" = $1  [["beer_id", 1]]
---
  def show_beers
    @list = List.where beer_id: params[:id]