app/controllers/locations_controller.rb

  def index #GET
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def show_name
    fuzzy = FuzzyMatch.new(Location.all, :read => :name)
    @location = fuzzy.find(params[:name])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."name" = $1 LIMIT 1  [["name", ""]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", nil]]

  def create #POST
    @location = Location.new(location_params)
    if @location.save
---
INSERT INTO "locations" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "The Barking Crab"], ["address", "88 Sleeper Street Boston, MA 02210"], ["created_at", "2015-05-30 21:34:10.949748"], ["updated_at", "2015-05-30 21:34:10.949748"]]

  def add_beer
    @location = Location.find(params[:id])
    @beer = Beer.find(params[:beer])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT 1  [["id", 4]]

  def show #GET
    @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 3]]

  def remove_beer #DELETE
    @list = List.where(beer_id: params[:beer], location_id: params[:id]).first
    @list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."beer_id" = $1 AND "lists"."location_id" = $2  ORDER BY "lists"."id" ASC LIMIT 1  [["beer_id", 4], ["location_id", 3]]
DELETE FROM "beers" WHERE "beers"."id" = $1  [["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 7]]